    CREATION OF DATAFRAME

In [2]:
import pandas as pd

emp = {"Name":["John","Peter","Lisa"],
        "Age":[25,28,31],
       "Salary":[30000,40000,50000]
}
print(pd.DataFrame(emp))

    Name  Age  Salary
0   John   25   30000
1  Peter   28   40000
2   Lisa   31   50000

In [3]:
data = pd.read_csv("C:/Users/vaish/Downloads/DataSets/Insta_ds/users.csv")
print(data)

     id     name      created time private/public  post count Verified status
0     1   Kenton  16-02-2017 18.22            yes          11              no
1     2    Andre  02-04-2017 17.11             no           7              no
2     3   Harley  21-02-2017 11.12             no           2              no
3     4    Arely   13-08-2016 1.28            yes           1              no
4     5    Aniya   07-12-2016 1.04            yes           3              no
..  ...      ...               ...            ...         ...             ...
95   96   Keenan  28-08-2016 14.57            yes         687              no
96   97    Tomas  11-02-2017 11.38            yes          92              no
97   98    Imani  31-01-2017 22.59             no         123              no
98   99     Alek   10-12-2016 7.43             no         232              no
99  100  Javonte  27-03-2017 22.06            yes          32             yes

[100 rows x 6 columns]

In [4]:
# to view top/bottom x rows of data
print(data.head(10))
print(data.tail(10))

   id     name      created time private/public  post count Verified status
0   1   Kenton  16-02-2017 18.22            yes          11              no
1   2    Andre  02-04-2017 17.11             no           7              no
2   3   Harley  21-02-2017 11.12             no           2              no
3   4    Arely   13-08-2016 1.28            yes           1              no
4   5    Aniya   07-12-2016 1.04            yes           3              no
5   6   Travon  30-04-2017 13.26             no          14              no
6   7   Kasand   12-12-2016 6.50             no         244              no
7   8  Tabitha   20-08-2016 2.19            yes          12              no
8   9    Gus93  24-06-2016 19.36            yes          45              no
9  10  Presley  07-08-2016 16.25             no         370              no
     id     name      created time private/public  post count Verified status
90   91   Bethan  03-06-2016 23.31             no          79              no
91   92  Frederi  06-07-2016 21.56            yes           2              no
92   93   Willie   15-02-2017 1.40            yes           1              no
93   94    Damon  31-10-2016 14.44             no           0             yes
94   95   Nicole  09-05-2016 17.30             no           9              no
95   96   Keenan  28-08-2016 14.57            yes         687              no
96   97    Tomas  11-02-2017 11.38            yes          92              no
97   98    Imani  31-01-2017 22.59             no         123              no
98   99     Alek   10-12-2016 7.43             no         232              no
99  100  Javonte  27-03-2017 22.06            yes          32             yes

In [5]:
# to get info about datatypes of different cols of data

print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               100 non-null    int64
 1   name             100 non-null    object
 2   created time     100 non-null    object
 3   private/public   100 non-null    object
 4   post count       100 non-null    int64
 5   Verified status  100 non-null    object
dtypes: int64(2), object(4)
memory usage: 4.8+ KB
None

In [6]:
#to summarize numerical columns of data

data.describe()

               id   post count
count  100.000000   100.000000
mean    50.500000   215.370000
std     29.011492   534.756995
min      1.000000     0.000000
25%     25.750000     2.000000
50%     50.500000    12.000000
75%     75.250000    78.000000
max    100.000000  2400.000000

In [8]:
print(data.index,"\n")
print(data.columns,"\n")
print(data.values)

RangeIndex(start=0, stop=100, step=1)

Index(['id', 'name', 'created time', 'private/public', 'post count',
       'Verified status'],
      dtype='object')

[[1 'Kenton' '16-02-2017 18.22' 'yes' 11 'no']
 [2 'Andre' '02-04-2017 17.11' 'no' 7 'no']
 [3 'Harley' '21-02-2017 11.12' 'no' 2 'no']
 [4 'Arely' '13-08-2016 1.28' 'yes' 1 'no']
 [5 'Aniya' '07-12-2016 1.04' 'yes' 3 'no']
 [6 'Travon' '30-04-2017 13.26' 'no' 14 'no']
 [7 'Kasand' '12-12-2016 6.50' 'no' 244 'no']
 [8 'Tabitha' '20-08-2016 2.19' 'yes' 12 'no']
 [9 'Gus93' '24-06-2016 19.36' 'yes' 45 'no']
 [10 'Presley' '07-08-2016 16.25' 'no' 370 'no']
 [11 'Justina' '04-05-2017 16.32' 'no' 1293 'no']
 [12 'Dereck' '19-01-2017 1.34' 'yes' 11 'no']
 [13 'Alexand' '29-03-2017 17.09' 'yes' 7 'no']
 [14 'Jaclyn' '06-02-2017 23.29' 'no' 2 'no']
 [15 'Billy52' '05-10-2016 14.10' 'no' 1 'no']
 [16 'Annali' '02-08-2016 21.32' 'yes' 3 'no']
 [17 'Norbert' '06-02-2017 22.05' 'yes' 14 'yes']
 [18 'Odessa' '21-10-2016 18.16' 'no' 244 'no']
 [19 'Hailee' '29-04-2017 18.53' 'no' 12 'no']
 [20 'Delpha' '31-08-2016 2.42' 'yes' 45 'no']
 [21 'Rocio33' '23-01-2017 11.51' 'yes' 370 'no']
 [22 'Kennet' '27-12-2016 9.48' 'no' 1293 'no']
 [23 'Eveline' '23-01-2017 23.14' 'no' 2400 'no']
 [24 'Maxwell' '18-04-2017 2.32' 'yes' 12 'no']
 [25 'Tierra' '03-10-2016 12.49' 'yes' 59 'no']
 [26 'Josianne' '07-06-2016 12.47' 'no' 56 'no']
 [27 'Darwin' '18-03-2017 3.10' 'no' 78 'yes']
 [28 'Dario77' '18-08-2016 7.15' 'yes' 2 'yes']
 [29 'Jaime53' '11-09-2016 18.51' 'yes' 1 'no']
 [30 'Kaley9' '23-09-2016 21.24' 'no' 0 'no']
 [31 'Aiyana' '29-09-2016 20.28' 'no' 12 'no']
 [32 'Irwin' '26-08-2016 19.36' 'yes' 45 'no']
 [33 'Yvette' '14-11-2016 12.32' 'yes' 370 'no']
 [34 'Pearl7' '08-07-2016 21.42' 'no' 1293 'no']
 [35 'Lennie' '30-03-2017 3.25' 'no' 2400 'no']
 [36 'Ollie' '04-08-2016 15.42' 'yes' 12 'no']
 [37 'Yazmin' '27-07-2016 0.56' 'yes' 59 'no']
 [38 'Jordyn' '14-05-2016 7.56' 'no' 56 'no']
 [39 'Kelsi26' '08-06-2016 17.48' 'no' 78 'no']
 [40 'Rafael' '19-05-2016 9.51' 'yes' 2 'no']
 [41 'Mcken' '17-07-2016 17.25' 'yes' 1 'no']
 [42 'Maya' '11-12-2016 18.04' 'no' 0 'no']
 [43 'Janet' '06-10-2016 7.57' 'no' 11 'yes']
 [44 'Seth4' '07-07-2016 11.40' 'yes' 7 'no']
 [45 'David' '05-02-2017 21.23' 'yes' 2 'no']
 [46 'Malinda' '09-07-2016 21.37' 'no' 1 'no']
 [47 'Harrison' '02-09-2016 3.48' 'no' 3 'no']
 [48 'Granville' '26-06-2016 3.10' 'yes' 14 'no']
 [49 'Morgan' '30-10-2016 12.42' 'yes' 244 'no']
 [50 'Gerard' '23-08-2016 19.47' 'no' 12 'no']
 [51 'Mariano' '17-04-2017 14.14' 'no' 45 'no']
 [52 'Zack' '01-01-2017 5.58' 'yes' 370 'no']
 [53 'Linnea' '07-02-2017 7.49' 'yes' 1293 'no']
 [54 'Duane' '21-12-2016 4.43' 'no' 11 'no']
 [55 'Meggie' '04-04-2017 12.17' 'no' 7 'no']
 [56 'Peter' '22-08-2016 18.05' 'yes' 2 'no']
 [57 'Julien' '02-02-2017 23.12' 'yes' 1 'no']
 [58 'Aurelie' '31-05-2016 6.20' 'no' 3 'no']
 [59 'Cesar' '18-10-2016 16.42' 'no' 14 'no']
 [60 'Sam52' '30-03-2017 22.03' 'yes' 244 'no']
 [61 'Jayson' '14-10-2016 19.10' 'yes' 12 'no']
 [62 'Ressie' '20-12-2016 15.09' 'no' 45 'no']
 [63 'Elenor88' '08-05-2016 1.30' 'no' 370 'no']
 [64 'Florence' '06-10-2016 23.08' 'yes' 1293 'yes']
 [65 'Adelle96' '01-10-2016 0.37' 'yes' 2400 'no']
 [66 'Mike' '01-07-2016 17.36' 'no' 12 'no']
 [67 'Emilio' '06-05-2016 13.04' 'no' 59 'no']
 [68 'Franco' '13-11-2016 20.09' 'yes' 56 'no']
 [69 'Karley' '24-06-2016 23.38' 'yes' 78 'no']
 [70 'Erick5' '05-04-2017 23.44' 'no' 2 'no']
 [71 'Nia_Ha' '14-05-2016 15.38' 'no' 1 'no']
 [72 'Kathryn' '11-10-2016 9.01' 'yes' 12 'no']
 [73 'Jaylan' '10-06-2016 23.58' 'yes' 3 'no']
 [74 'Hulda' '25-01-2017 17.17' 'no' 1 'no']
 [75 'Leslie' '21-09-2016 5.14' 'no' 3 'no']
 [76 'Janelle' '21-07-2016 9.26' 'yes' 79 'no']
 [77 'Donald' '07-01-2017 10.05' 'yes' 2 'no']
 [78 'Colten' '10-10-2016 2.38' 'no' 1 'no']
 [79 'Katarina' '03-11-2016 13.14' 'no' 0 'no']
 [80 'djkrhf' '06-05-2016 0.14' 'yes' 2400 'no']
 [81 'Esther' '14-01-2017 17.02' 'yes' 12 'no']
 [82 'Aracely' '25-07-2016 18.49' 'no' 59 'no']
 [83 'Barthol' '06-11-2016 2.31' 'no' 56 'no']
 [84 'Alysa22' '01-01-2017 17.44' 'yes' 78 'no']
 [85 'Milford' '30-04-2017 7.50' 'yes' 2 'no']
 [86 'Delfina' '21-03-2017 12.02' 'no' 1 'no']
 [87 'Rick29' '24-02-2017 11.25' 'no' 12 'no']
 [88 'Clint27' '02-06-2016 21.40' 'yes' 3 'yes']
 [89 'Jessyca' '14-09-2016 23.47' 'yes' 1 'no']
 [90 'Esmera' '03-03-2017 11.52' 'no' 3 'no']
 [91 'Bethan' '03-06-2016 23.31' 'no' 79 'no']
 [92 'Frederi' '06-07-2016 21.56' 'yes' 2 'no']
 [93 'Willie' '15-02-2017 1.40' 'yes' 1 'no']
 [94 'Damon' '31-10-2016 14.44' 'no' 0 'yes']
 [95 'Nicole' '09-05-2016 17.30' 'no' 9 'no']
 [96 'Keenan' '28-08-2016 14.57' 'yes' 687 'no']
 [97 'Tomas' '11-02-2017 11.38' 'yes' 92 'no']
 [98 'Imani' '31-01-2017 22.59' 'no' 123 'no']
 [99 'Alek' '10-12-2016 7.43' 'no' 232 'no']
 [100 'Javonte' '27-03-2017 22.06' 'yes' 32 'yes']]

In [10]:
brand = pd.read_csv("C:/Users/vaish/Downloads/Exercises+and+Datasets2/Exercises and Datasets/Datasets/DataCo_Products.csv")
print(brand)
print(brand.isnull())

      Prod Id Product Name  Prod Cat Id Prod Cat Name  Prod Price
0         191      Nike Me          9.0    Cardio Equ   99.989998
1         627      Under A         29.0    Shop By Sp   39.990002
2         917      Glove I         41.0      Trade-In         NaN
3         828      Bridges         37.0    Electronic   31.990000
4         191      Nike Me          9.0    Cardio Equ   99.989998
...       ...          ...          ...           ...         ...
1264      135      Nike Dr          7.0        Hockey   22.000000
1265      135      Nike Dr          7.0        Hockey   22.000000
1266      135      Nike Dr          7.0        Hockey   22.000000
1267      135      Nike Dr          7.0        Hockey   22.000000
1268      135      Nike Dr          7.0           NaN   22.000000

[1269 rows x 5 columns]
      Prod Id  Product Name  Prod Cat Id  Prod Cat Name  Prod Price
0       False         False        False          False       False
1       False         False        False          False       False
2       False         False        False          False        True
3       False         False        False          False       False
4       False         False        False          False       False
...       ...           ...          ...            ...         ...
1264    False         False        False          False       False
1265    False         False        False          False       False
1266    False         False        False          False       False
1267    False         False        False          False       False
1268    False         False        False           True       False

[1269 rows x 5 columns]

In [11]:
print(brand.describe())

           Prod Id  Prod Cat Id   Prod Price
count  1269.000000  1253.000000  1254.000000
mean    558.958235    27.213887   112.252497
std     382.239308    20.279175   132.519540
min      24.000000     2.000000    15.990000
25%     365.000000    17.000000    50.000000
50%     403.000000    18.000000    59.990002
75%     627.000000    29.000000   129.990005
max    1363.000000    76.000000  1500.000000

In [12]:
# count nulls in each col
print(brand.isnull().sum())

Prod Id           0
Product Name     10
Prod Cat Id      16
Prod Cat Name     9
Prod Price       15
dtype: int64

    MANAGING DUPLICATE VALUES

In [13]:
print(brand.duplicated())
print("There are total of ", brand.duplicated().sum(), " duplicate values")

0       False
1       False
2       False
3       False
4        True
        ...
1264     True
1265     True
1266     True
1267     True
1268    False
Length: 1269, dtype: bool
There are total of  1177  duplicate values

In [14]:
#counting number of duplicates in each col      
print(brand["Prod Id"].duplicated().sum())
print(brand["Product Name"].duplicated().sum())
print(brand["Prod Cat Id"].duplicated().sum())
print(brand["Prod Cat Name"].duplicated().sum())
print(brand["Prod Price"].duplicated().sum())

1210
1239
1236
1237
1232

In [15]:
#Removing Duplicates
print(brand.drop_duplicates())

      Prod Id Product Name  Prod Cat Id Prod Cat Name  Prod Price
0         191      Nike Me          9.0    Cardio Equ   99.989998
1         627      Under A         29.0    Shop By Sp   39.990002
2         917      Glove I         41.0      Trade-In         NaN
3         828      Bridges         37.0    Electronic   31.990000
5         403      Nike Me         18.0    Men's Foot  129.990005
...       ...          ...          ...           ...         ...
1127      797      Hirzl W         36.0    Golf Balls   17.990000
1189      235      Under A         11.0    Fitness Ac         NaN
1251      135          NaN          7.0        Hockey   22.000000
1257      135      Nike Dr          7.0        Hockey         NaN
1268      135      Nike Dr          7.0           NaN   22.000000

[92 rows x 5 columns]

    HANDLING NULL VALUES

In [16]:
# to drop all NULL value rows
print(brand.dropna().sum())

Prod Id                                                     679721
Product Name     Nike MeUnder ABridgesNike MeNike MeNike MeNike...
Prod Cat Id                                                33070.0
Prod Cat Name    Cardio EquShop By SpElectronicCardio EquMen's ...
Prod Price                                           136596.471499
dtype: object

In [17]:
# to fill NULL cells with any value
import numpy as np
print(brand.replace(np.nan,'hi').tail(13))

      Prod Id Product Name Prod Cat Id Prod Cat Name Prod Price
1256      135      Nike Dr         7.0        Hockey       22.0
1257      135      Nike Dr         7.0        Hockey         hi
1258      135      Nike Dr         7.0        Hockey       22.0
1259      135      Nike Dr         7.0        Hockey       22.0
1260      135      Nike Dr         7.0        Hockey       22.0
1261      135      Nike Dr         7.0        Hockey       22.0
1262      135      Nike Dr         7.0        Hockey       22.0
1263      135      Nike Dr         7.0        Hockey       22.0
1264      135      Nike Dr         7.0        Hockey       22.0
1265      135      Nike Dr         7.0        Hockey       22.0
1266      135      Nike Dr         7.0        Hockey       22.0
1267      135      Nike Dr         7.0        Hockey       22.0
1268      135      Nike Dr         7.0            hi       22.0

In [18]:
# to fill below value in NAN value cells

print(brand.fillna(method="bfill").head(19))

    Prod Id Product Name  Prod Cat Id Prod Cat Name  Prod Price
0       191      Nike Me          9.0    Cardio Equ   99.989998
1       627      Under A         29.0    Shop By Sp   39.990002
2       917      Glove I         41.0      Trade-In   31.990000
3       828      Bridges         37.0    Electronic   31.990000
4       191      Nike Me          9.0    Cardio Equ   99.989998
5       403      Nike Me         18.0    Men's Foot  129.990005
6       403      Nike Me         18.0    Men's Foot  129.990005
7       403      Nike Me         18.0    Men's Foot  129.990005
8       365      Perfect         17.0        Cleats   59.990002
9       403      Nike Me         18.0    Men's Foot  129.990005
10      957      Diamond         43.0    Camping &   299.980011
11      957      Diamond         43.0    Camping &   299.980011
12      365      Perfect         17.0        Cleats   59.990002
13      365      Perfect         17.0        Cleats   59.990002
14      502      Nike Me         24.0    Women's Ap   50.000000
15      627      Under A         29.0    Shop By Sp   39.990002
16      502      Nike Me         24.0    Women's Ap   50.000000
17      905      Team Go          9.0    Accessorie   24.990000
18      191      Nike Me          9.0    Cardio Equ   99.989998

C:\Users\vaish\AppData\Local\Temp\ipykernel_19056\1199138802.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(brand.fillna(method="bfill").head(19))

In [19]:
# to fill previous value in NAN value cells

print(brand.fillna(method="ffill").head(18))

    Prod Id Product Name  Prod Cat Id Prod Cat Name  Prod Price
0       191      Nike Me          9.0    Cardio Equ   99.989998
1       627      Under A         29.0    Shop By Sp   39.990002
2       917      Glove I         41.0      Trade-In   39.990002
3       828      Bridges         37.0    Electronic   31.990000
4       191      Nike Me          9.0    Cardio Equ   99.989998
5       403      Nike Me         18.0    Men's Foot  129.990005
6       403      Nike Me         18.0    Men's Foot  129.990005
7       403      Nike Me         18.0    Men's Foot  129.990005
8       365      Perfect         17.0        Cleats   59.990002
9       403      Nike Me         18.0    Men's Foot  129.990005
10      957      Diamond         43.0    Camping &   299.980011
11      957      Diamond         43.0    Camping &   299.980011
12      365      Perfect         17.0        Cleats   59.990002
13      365      Perfect         17.0        Cleats   59.990002
14      502      Nike Me         24.0    Women's Ap   50.000000
15      627      Under A         29.0    Shop By Sp   39.990002
16      502      Nike Me         24.0    Women's Ap   50.000000
17      905      Team Go         24.0    Accessorie   24.990000

C:\Users\vaish\AppData\Local\Temp\ipykernel_19056\3231360654.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(brand.fillna(method="ffill").head(18))

    TRANSFORMING COLUMN DATA

In [20]:
# to read xl file & concat 2 col
#in CMD type pip install openpyxl
import pandas as pd
actor = pd.read_excel("C:/Users/vaish/Downloads/Exercises+and+Datasets2/Exercises and Datasets/Datasets/practice.xlsx")
print(actor)
print()
actor["Fullname"] = actor["First Name"].str.capitalize() +" "+actor["Last Name"].str.capitalize()
actor["Bonus"] = (actor["Salary"]/100)*20
print(actor)

  EmpID First Name Last Name  Salary Joined Month
0    E1       Ross      Trib   20000      January
1    E2     Rachel      Bing   40000     February
2    E7     Monica     Green   25000        March
3    E8       Joey    Geller   60000        April
4    E4   Chandler    Buffay   33000          May
5    E5     Pheobe      Bing   45000         June

  EmpID First Name Last Name  Salary Joined Month         Fullname    Bonus
0    E1       Ross      Trib   20000      January        Ross Trib   4000.0
1    E2     Rachel      Bing   40000     February      Rachel Bing   8000.0
2    E7     Monica     Green   25000        March     Monica Green   5000.0
3    E8       Joey    Geller   60000        April      Joey Geller  12000.0
4    E4   Chandler    Buffay   33000          May  Chandler Buffay   6600.0
5    E5     Pheobe      Bing   45000         June      Pheobe Bing   9000.0

In [21]:
# to add column with conditions
brand.loc[(brand["Prod Price"]<100),'Price Category'] = "cheap product"
brand.loc[np.logical_and(brand["Prod Price"]>=100,brand["Prod Price"]<500),'Price Category'] = "normal product"
brand.loc[np.logical_and(brand["Prod Price"]>=500,brand["Prod Price"]<1000),'Price Category'] = "average product"
brand.loc[(brand["Prod Price"]>1000),'Price Category'] = "expensive product"
print(brand.head(300))

     Prod Id Product Name  Prod Cat Id Prod Cat Name   Prod Price  \
0        191      Nike Me          9.0    Cardio Equ    99.989998
1        627      Under A         29.0    Shop By Sp    39.990002
2        917      Glove I         41.0      Trade-In          NaN
3        828      Bridges         37.0    Electronic    31.990000
4        191      Nike Me          9.0    Cardio Equ    99.989998
..       ...          ...          ...           ...          ...
295     1349      Web Cam         62.0      Cameras    452.040008
296     1349      Web Cam         62.0      Cameras           NaN
297     1351      Dell La         64.0     Computers  1500.000000
298     1349      Web Cam         62.0      Cameras    452.040008
299     1352      Industr         65.0    Consumer E   252.880005

        Price Category
0        cheap product
1        cheap product
2                  NaN
3        cheap product
4        cheap product
..                 ...
295     normal product
296                NaN
297  expensive product
298     normal product
299     normal product

[300 rows x 6 columns]

In [22]:
# extract some text from data 

def extract(value):
    return value[0:3]

actor["short_month"] = actor["Joined Month"].map(extract)
print(actor)

  EmpID First Name Last Name  Salary Joined Month         Fullname    Bonus  \
0    E1       Ross      Trib   20000      January        Ross Trib   4000.0
1    E2     Rachel      Bing   40000     February      Rachel Bing   8000.0
2    E7     Monica     Green   25000        March     Monica Green   5000.0
3    E8       Joey    Geller   60000        April      Joey Geller  12000.0
4    E4   Chandler    Buffay   33000          May  Chandler Buffay   6600.0
5    E5     Pheobe      Bing   45000         June      Pheobe Bing   9000.0

  short_month
0         Jan
1         Feb
2         Mar
3         Apr
4         May
5         Jun

    GROUPING & FILTERING

In [97]:
# to sort data based on increasing salary
emp = pd.read_excel("ESD.xlsx")
print(emp.sort_values("Annual Salary",ascending=False))
#to sort based on multiple cols
print(emp.sort_values(["Bonus %","Annual Salary]))
#to sort asc/desc differently on different cols
print(emp.sort_values(["Bonus %","Annual Salary"],ascending=[True , False]))
#

       EEID     Full Name        Job Title  Department  \
989  E04354  Raelynn Rios   Vice President       Sales
232  E04742  Kinsley Vega   Vice President  Accounting
900  E02522  Silas Rivera   Vice President       Sales
549  E01371    Dominic Le   Vice President   Marketing
610  E04170  Grayson Chin   Vice President          IT
..      ...           ...              ...         ...
787  E02732    Alice Tran          Analyst   Marketing
182  E03719    Jack Brown          Analyst   Marketing
823  E00862   Levi Moreno  Systems Analyst          IT
782  E04109   Leah Bryant   IT Coordinator          IT
781  E03928    Miles Dang   IT Coordinator          IT

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
989           Manufacturing  Female     Latino   43 2016-08-21         258498
232               Corporate  Female     Latino   33 2020-12-16         258426
900               Corporate    Male     Latino   48 2000-02-28         258081
549               Corporate    Male      Asian   41 2014-10-04         257194
610  Research & Development    Male      Asian   26 2020-05-09         256561
..                      ...     ...        ...  ...        ...            ...
787               Corporate  Female      Asian   39 2014-07-29          40897
182               Corporate    Male  Caucasian   55 2004-12-07          40752
823  Research & Development    Male     Latino   64 2020-06-27          40316
782           Manufacturing  Female  Caucasian   55 2004-04-30          40124
781     Speciality Products    Male      Asian   61 2000-09-24          40063

     Bonus %        Country            City Exit Date
989     0.35  United States        Columbus       NaT
232     0.40         Brazil  Rio de Janerio       NaT
900     0.30  United States         Chicago       NaT
549     0.35          China       Chongqing       NaT
610     0.39  United States          Austin       NaT
..       ...            ...             ...       ...
787     0.00  United States         Seattle       NaT
182     0.00  United States         Phoenix       NaT
823     0.00         Brazil          Manaus       NaT
782     0.00  United States          Austin       NaT
781     0.00  United States           Miami       NaT

[1000 rows x 14 columns]

In [29]:
# grouping above data based on any column
gbd = emp.groupby("Department").agg({"EEID":"count"})
print(gbd)
gbjt = emp.groupby(["Job Title","Gender"]).agg({"EEID":"count"})
print(gbjt)

                 EEID
Department
Accounting         96
Engineering       158
Finance           120
Human Resources   125
IT                241
Marketing         120
Sales             140
                               EEID
Job Title              Gender
Account Representative Female    15
                       Male       6
Analyst                Female    31
                       Male      20
Analyst II             Female    21
...                             ...
Technical Architect    Male       8
Test Engineer          Female     7
                       Male       5
Vice President         Female    50
                       Male      55

[66 rows x 1 columns]

In [33]:
# grouping based on avg resource age of each country
gbc = emp.groupby("Country").agg({"Age":"mean"})
print(gbc)
gbc = emp.groupby(["Country","Gender"]).agg({"Age":"mean"})
print(gbc)

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512
                            Age
Country       Gender
Brazil        Female  42.240000
              Male    45.312500
China         Female  44.752294
              Male    46.027523
United States Female  44.580838
              Male    43.783172

In [36]:
# grouping based on max salary of each country
gbs = emp.groupby("Country").agg({"Annual Salary":"max"})
print(gbs)
gbs = emp.groupby(["Country","Gender"]).agg({"Annual Salary":"max","Age":"min"})
print(gbs)

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498
                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

In [116]:
#filtering data based on particular column(s)
print(emp["Ethnicity"])
print(emp[["Ethnicity","Country"]])
print(emp[emp["Bonus %"]>0])
print(emp[emp["Hire Date"]>"2021-01-01"])

0          Black
1          Asian
2      Caucasian
3      Caucasian
4          Asian
         ...
995    Caucasian
996        Asian
997        Asian
998        Asian
999        Asian
Name: Ethnicity, Length: 1000, dtype: object
     Ethnicity        Country
0        Black  United States
1        Asian          China
2    Caucasian  United States
3    Caucasian  United States
4        Asian  United States
..         ...            ...
995  Caucasian  United States
996      Asian          China
997      Asian  United States
998      Asian          China
999      Asian  United States

[1000 rows x 2 columns]
       EEID          Full Name                 Job Title  Department  \
0    E02387        Emily Davis                Sr. Manger          IT
2    E02572       Luna Sanders                  Director     Finance
3    E02832    Penelope Jordan  Computer Systems Manager          IT
6    E01550        Ruby Barnes                   Manager          IT
8    E04533      Easton Bailey                   Manager  Accounting
..      ...                ...                       ...         ...
989  E04354       Raelynn Rios            Vice President       Sales
990  E01578       Anthony Hong                Sr. Manger          IT
993  E04762  Audrey Richardson                  Director          IT
997  E04398        Oliver Yang                  Director   Marketing
999  E03545        Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
6                 Corporate  Female  Caucasian   27 2020-07-01         119746
8             Manufacturing    Male  Caucasian   29 2019-01-25         113527
..                      ...     ...        ...  ...        ...            ...
989           Manufacturing  Female     Latino   43 2016-08-21         258498
990  Research & Development    Male      Asian   37 2010-11-29         146961
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
997     Speciality Products    Male      Asian   31 2019-06-10         176710
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
0       0.15  United States   Seattle 2021-10-16
2       0.20  United States   Chicago        NaT
3       0.07  United States   Chicago        NaT
6       0.10  United States   Phoenix        NaT
8       0.06  United States    Austin        NaT
..       ...            ...       ...        ...
989     0.35  United States  Columbus        NaT
990     0.11  United States  Columbus        NaT
993     0.17  United States   Chicago        NaT
997     0.15  United States     Miami        NaT
999     0.31  United States     Miami        NaT

[475 rows x 14 columns]
       EEID       Full Name               Job Title   Department  \
11   E03344   Camila Rogers       Controls Engineer  Engineering
13   E04239    Everleigh Ng              Sr. Manger      Finance
21   E04732      Eva Rivera                Director        Sales
51   E00415  Leilani Butler              Analyst II    Marketing
52   E02862    Peyton Huang              Sr. Manger           IT
..      ...             ...                     ...          ...
937  E02696         Ryan Lu    Development Engineer  Engineering
952  E03000     Hailey Hong  Account Representative        Sales
959  E01488      Stella Lai             Sr. Analyst   Accounting
980  E00785    Hannah Hoang                 Manager   Accounting
984  E02191       Maria Sun                Director        Sales

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
11      Speciality Products  Female  Caucasian   27 2021-10-21         109851
13   Research & Development  Female      Asian   51 2021-06-10         146742
21            Manufacturing  Female     Latino   36 2021-04-02         151703
51            Manufacturing  Female      Black   27 2021-09-21          68728
52            Manufacturing  Female      Asian   25 2021-07-02         125633
..                      ...     ...        ...  ...        ...            ...
937     Speciality Products    Male      Asian   25 2021-07-08          67275
952  Research & Development  Female      Asian   33 2021-01-22          56405
959           Manufacturing  Female      Asian   44 2021-04-28          98520
980     Speciality Products  Female      Asian   25 2021-12-15         114893
984               Corporate  Female      Asian   25 2021-12-19         150666

     Bonus %        Country      City Exit Date
11      0.00  United States   Seattle       NaT
13      0.10          China  Shanghai       NaT
21      0.21  United States     Miami       NaT
51      0.00  United States   Phoenix       NaT
52      0.11          China   Beijing       NaT
..       ...            ...       ...       ...
937     0.00  United States  Columbus       NaT
952     0.00  United States   Chicago       NaT
959     0.00  United States     Miami       NaT
980     0.06          China   Chengdu       NaT
984     0.23          China   Chengdu       NaT

[86 rows x 14 columns]

In [123]:
#subsetting based on multiple conditions
is_asian = emp["Ethnicity"] == "Asian"
is_IT = emp["Department"] == "IT"
print(emp[is_asian & is_IT])
print()
is_age = emp["Age"].isin([10,20,60,70,80,90])
print(emp[is_age])

       EEID       Full Name                       Job Title Department  \
1    E04105   Theodore Dinh             Technical Architect         IT
29   E00304      Dylan Choi                  Vice President         IT
30   E02594   Ezekiel Kumar                  IT Coordinator         IT
52   E02862    Peyton Huang                      Sr. Manger         IT
69   E03349      Anna Mehta  Cloud Infrastructure Architect         IT
..      ...             ...                             ...        ...
953  E01611   Gabriella Zhu        Computer Systems Manager         IT
956  E03168         Nora Le                      Sr. Manger         IT
982  E03247     Aaliyah Mai                  Vice President         IT
990  E01578    Anthony Hong                      Sr. Manger         IT
994  E01148  Scarlett Kumar                 Systems Analyst         IT

              Business Unit  Gender Ethnicity  Age  Hire Date  Annual Salary  \
1             Manufacturing    Male     Asian   59 1997-11-29          99975
29                Corporate    Male     Asian   63 2012-05-11         231141
30   Research & Development    Male     Asian   28 2017-06-25          54775
52            Manufacturing  Female     Asian   25 2021-07-02         125633
69      Speciality Products  Female     Asian   32 2020-01-05          78844
..                      ...     ...       ...  ...        ...            ...
953     Speciality Products  Female     Asian   36 2014-11-29          88730
956           Manufacturing  Female     Asian   53 1997-04-12         154388
982     Speciality Products  Female     Asian   57 2016-11-11         246589
990  Research & Development    Male     Asian   37 2010-11-29         146961
994               Corporate  Female     Asian   55 2009-01-07          47032

     Bonus %        Country       City  Exit Date
1       0.00          China  Chongqing        NaT
29      0.34          China    Beijing        NaT
30      0.00  United States   Columbus        NaT
52      0.11          China    Beijing        NaT
69      0.00  United States    Seattle        NaT
..       ...            ...        ...        ...
953     0.08          China  Chongqing        NaT
956     0.10  United States    Seattle        NaT
982     0.33  United States    Phoenix 2017-03-26
990     0.11  United States   Columbus        NaT
994     0.00  United States   Columbus        NaT

[93 rows x 14 columns]

       EEID           Full Name                   Job Title       Department  \
79   E02166           John Soto                  Sr. Manger          Finance
117  E04379  Scarlett Rodriguez                 Sr. Analyst          Finance
339  E00265        Mila Vasquez            Quality Engineer      Engineering
363  E04571    Hadley Contreras                    Director      Engineering
372  E03854           Camila Li                  Sr. Manger               IT
482  E02185         Aubrey Yoon        Sr. Business Partner  Human Resources
485  E00784         Ella Nguyen        Service Desk Analyst               IT
491  E00436       Lincoln Reyes    Computer Systems Manager               IT
493  E04662        Julia Morris                  Sr. Manger  Human Resources
540  E03181        Greyson Dang        Development Engineer      Engineering
566  E03402           Isaac Liu              Field Engineer      Engineering
572  E00161             Ryan Ha              Vice President        Marketing
585  E04087           Adam Kaur                     Manager               IT
633  E04277              Zoe Do                  Analyst II            Sales
664  E02884        Axel Johnson                    Director  Human Resources
673  E04221          Roman King                  Analyst II          Finance
688  E03968         Joshua Chin                  Sr. Manger        Marketing
755  E04415       Penelope Fong                    Director       Accounting
780  E01413     Caroline Nelson  Sr. Account Representative            Sales
797  E00287         Luca Nelson                     Manager          Finance
868  E04464         Cooper Yoon         Engineering Manager      Engineering
986  E03349          Dylan Chin                    Director          Finance

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
79            Manufacturing    Male     Latino   60 2015-09-23         141899
117           Manufacturing  Female     Latino   60 2007-02-24          71699
339           Manufacturing  Female     Latino   60 1998-07-16          92932
363               Corporate  Female     Latino   60 2017-01-04         178502
372  Research & Development  Female      Asian   60 2010-07-24         126911
482  Research & Development  Female      Asian   60 2005-11-11          78388
485               Corporate  Female      Asian   60 2004-02-10          90258
491           Manufacturing    Male     Latino   60 1998-08-03          85120
493               Corporate  Female  Caucasian   60 2008-10-18         150855
540           Manufacturing    Male      Asian   60 2009-05-11          62239
566           Manufacturing    Male      Asian   60 1992-10-13          88213
572               Corporate    Male      Asian   60 2007-01-27         234311
585               Corporate    Male      Asian   60 2000-01-29         109059
633     Speciality Products  Female      Asian   60 2014-01-08          51877
664               Corporate    Male  Caucasian   60 2015-04-14         155788
673               Corporate    Male  Caucasian   60 2007-08-16          58671
688           Manufacturing    Male      Asian   60 2021-07-26         121480
755               Corporate  Female      Asian   60 2004-05-14         186378
780     Speciality Products  Female      Black   60 1997-07-30          71677
797     Speciality Products    Male  Caucasian   60 2010-06-15         106578
868  Research & Development    Male      Asian   60 2018-02-15         106079
986               Corporate    Male      Asian   60 2017-06-05         158898

     Bonus %        Country       City  Exit Date
79      0.15  United States    Phoenix        NaT
117     0.00         Brazil     Manaus        NaT
339     0.00  United States   Columbus        NaT
363     0.20  United States     Austin        NaT
372     0.10          China   Shanghai        NaT
482     0.00          China  Chongqing        NaT
485     0.00          China  Chongqing        NaT
491     0.09  United States    Seattle        NaT
493     0.11  United States    Phoenix        NaT
540     0.00          China    Beijing        NaT
566     0.00          China  Chongqing        NaT
572     0.37  United States      Miami        NaT
585     0.07          China    Chengdu        NaT
633     0.00          China    Beijing        NaT
664     0.17  United States    Seattle        NaT
673     0.00  United States   Columbus        NaT
688     0.14  United States    Phoenix        NaT
755     0.26          China  Chongqing        NaT
780     0.00  United States   Columbus        NaT
797     0.09  United States      Miami        NaT
868     0.14  United States     Austin 2021-04-09
986     0.18  United States      Miami        NaT

    MERGE DATAFRAMES

In [45]:
dayta1 = {"EmpID":["E01","E02","E03","E04","E05","E06"],
       "Names":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
       "Age":["34","56","23","44","32","55"]}
dayta2 = {"EmpID":["E01","E02","E03","E04","E05","E06"],
       "Salary":["34000","56000","23000","44000","32000","55000"]}
df1 = pd.DataFrame(dayta1)
df2 = pd.DataFrame(dayta2)
print(df1,"\n",df2)
print(pd.merge(df1,df2,on="EmpID"))

  EmpID   Names Age
0   E01     Ram  34
1   E02   Shyam  56
2   E03   Rahul  23
3   E04  Vishal  44
4   E05    Ravi  32
5   E06    John  55
   EmpID Salary
0   E01  34000
1   E02  56000
2   E03  23000
3   E04  44000
4   E05  32000
5   E06  55000
  EmpID   Names Age Salary
0   E01     Ram  34  34000
1   E02   Shyam  56  56000
2   E03   Rahul  23  23000
3   E04  Vishal  44  44000
4   E05    Ravi  32  32000
5   E06    John  55  55000

In [41]:
data1 = {"EmpID":["E01","E02","E03","E04","E05","E06"],
       "Names":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
       "Age":["34","56","23","44","32","55"]}
data2 = {"EmpID":["E01","E07","E03","E04","E08","E06"],
       "Salary":["34000","56000","23000","44000","32000","55000"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1,"\n",df2)
print(pd.merge(df1,df2,on="EmpID"))

  EmpID   Names Age
0   E01     Ram  34
1   E02   Shyam  56
2   E03   Rahul  23
3   E04  Vishal  44
4   E05    Ravi  32
5   E06    John  55
   EmpID Salary
0   E01  34000
1   E07  56000
2   E03  23000
3   E04  44000
4   E08  32000
5   E06  55000
  EmpID   Names Age Salary
0   E01     Ram  34  34000
1   E03   Rahul  23  23000
2   E04  Vishal  44  44000
3   E06    John  55  55000

In [43]:
#merging if table values are different
print(pd.merge(df1,df2,on="EmpID",how="inner"),"\n")
print(pd.merge(df1,df2,on="EmpID",how="left"),"\n")
print(pd.merge(df1,df2,on="EmpID",how="right"))

  EmpID   Names Age Salary
0   E01     Ram  34  34000
1   E03   Rahul  23  23000
2   E04  Vishal  44  44000
3   E06    John  55  55000

  EmpID   Names Age Salary
0   E01     Ram  34  34000
1   E02   Shyam  56    NaN
2   E03   Rahul  23  23000
3   E04  Vishal  44  44000
4   E05    Ravi  32    NaN
5   E06    John  55  55000

  EmpID   Names  Age Salary
0   E01     Ram   34  34000
1   E07     NaN  NaN  56000
2   E03   Rahul   23  23000
3   E04  Vishal   44  44000
4   E08     NaN  NaN  32000
5   E06    John   55  55000

    CONCATENATE DATAFRAMES

In [50]:
da1 = {"EmpID":["E01","E02","E03","E04","E05"],
       "Names":["Ram","Shyam","Rahul","Vishal","Ravi"],
       "Age":["34","56","23","44","32"]}
da2 = {"EmpID":["E06","E07","E08","E09","E10"],
       "Names":["cintu","bittu","pappu","chotu","golu"],
       "Age":["10","5","17","11","8"]}
dat1 = pd.DataFrame(da1)
dat2 = pd.DataFrame(da2)
print(pd.concat([dat1,dat2]))

  EmpID   Names Age
0   E01     Ram  34
1   E02   Shyam  56
2   E03   Rahul  23
3   E04  Vishal  44
4   E05    Ravi  32
0   E06   cintu  10
1   E07   bittu   5
2   E08   pappu  17
3   E09   chotu  11
4   E10    golu   8

    COMPARING DATAFRAMES

In [55]:
dict1 = {"Fruits":["apple","mango","banana","papaya"],
        "Price":["100","150","50","35"],
        "Quantity":["15","10","10","3"]}
shopnow = pd.DataFrame(dict1)
print(shopnow,"\n")
dict2 = dict1.copy()
shoplater = pd.DataFrame(dict2)
shoplater.loc[0,"Price"]=120
shoplater.loc[1,"Price"]=175
shoplater.loc[3,"Price"]=30
shoplater.loc[0,"Quantity"]=12
shoplater.loc[1,"Quantity"]=15
shoplater.loc[3,"Quantity"]=4
print(shoplater)

   Fruits Price Quantity
0   apple   100       15
1   mango   150       10
2  banana    50       10
3  papaya    35        3

   Fruits Price Quantity
0   apple   120       12
1   mango   175       15
2  banana    50       10
3  papaya    30        4

In [56]:
print(shopnow.compare(shoplater))
#print(shopnow.compare(shoplater, align_axis=1))

  Price       Quantity
   self other     self other
0   100   120       15    12
1   150   175       10    15
3    35    30        3     4

In [57]:
print(shopnow.compare(shoplater, align_axis=0))

        Price Quantity
0 self    100       15
  other   120       12
1 self    150       10
  other   175       15
3 self     35        3
  other    30        4

In [66]:
# to compare by keeping same values visible
print(shopnow.compare(shoplater, keep_shape=True))

  Fruits       Price       Quantity
    self other  self other     self other
0    NaN   NaN   100   120       15    12
1    NaN   NaN   150   175       10    15
2    NaN   NaN   NaN   NaN      NaN   NaN
3    NaN   NaN    35    30        3     4

    PIVOTING

In [71]:
# to convert a vertical table into horizontal
# takes parameters Index , Columns , Values
deta = {"key":["k1","k2","k1","k2"],
        "name":["John","Ben","David","Peter"],
        "house":["red","blue","green","red"]}
pivtbl = pd.DataFrame(deta)
print(pivtbl,"\n")
print(pivtbl.pivot(index="key",columns="name",values="house"))

  key   name  house
0  k1   John    red
1  k2    Ben   blue
2  k1  David  green
3  k2  Peter    red

name   Ben  David John Peter
key
k1     NaN  green  red   NaN
k2    blue    NaN  NaN   red

In [75]:
deta = {"key":["k1","k2","k1","k2"],
        "name":["John","Ben","David","Peter"],
        "house":["red","blue","green","red"],
        "grade":["3rd","8th","9th","8th"]}
pivtbl = pd.DataFrame(deta)
print(pivtbl,"\n")
print(pivtbl.pivot(index="key",columns="name",values=["house","grade"]))

  key   name  house grade
0  k1   John    red   3rd
1  k2    Ben   blue   8th
2  k1  David  green   9th
3  k2  Peter    red   8th

     house                   grade
name   Ben  David John Peter   Ben David John Peter
key
k1     NaN  green  red   NaN   NaN   9th  3rd   NaN
k2    blue    NaN  NaN   red   8th   NaN  NaN   8th

    MELTING DATAFRAMES

In [81]:
nhg = {"name":["John","Ben","David","Peter"],
       "house":["red","blue","green","red"],
       "grade":["3rd","8th","9th","8th"]}
mlt = pd.DataFrame(nhg)
print(mlt)

    name  house grade
0   John    red   3rd
1    Ben   blue   8th
2  David  green   9th
3  Peter    red   8th

In [82]:
#melting on house column
print(pd.melt(mlt,id_vars=["name"],value_vars=["house"]))

    name variable  value
0   John    house    red
1    Ben    house   blue
2  David    house  green
3  Peter    house    red

In [79]:
#melting on grade column
print(pd.melt(mlt,id_vars=["name"],value_vars=["grade"]))

    name variable value
0   John    grade   3rd
1    Ben    grade   8th
2  David    grade   9th
3  Peter    grade   8th

In [84]:
#melting on both house & grade column with renaming
print(pd.melt(mlt,id_vars=["name"],value_vars=["house","grade"],var_name="House&Grade",value_name="Vals"))

    name House&Grade   Vals
0   John       house    red
1    Ben       house   blue
2  David       house  green
3  Peter       house    red
4   John       grade    3rd
5    Ben       grade    8th
6  David       grade    9th
7  Peter       grade    8th